import Accordion from "./Accordion";

const PriceFAQSection = () => {
  return (
    <section className="pr-[23px] pl-[22px] pt-[95px] pb-[113px]  2xl:px-[221px] 2xl:pb-[225px] 2xl:h-[700px]">
      <h2 className="text-[18px] leading-[28.13px] font-bold text-center mb-8 md:text-right md:text-[32px] md:leading-[50px] md:mb-[46px]">
        سوالات متداول
      </h2>
      <div className="flex flex-col gap-y-[10px]">
        <div className="flex flex-col gap-y-[2px] h-[520px] md:h-[320px] md:grid md:grid-cols-2 md:gap-x-7">
          <div className="lg:hidden">
            <Accordion data={mobileData} />
          </div>
          <div className="hidden lg:block">
            <Accordion data={desktopData1} />
          </div>
          <div className="hidden lg:block">
            <Accordion data={desktopData2} />
          </div>
        </div>
      </div>
    </section>
  );
};

export default PriceFAQSection;

const desktopData1 = [
  {
    id: 1,
    title: "هزینه بیمه نگهداری در روناد چقدر است؟",
    content:
      "بیمه نگهداری کالا در انبار روناد رایگان بوده و در صورت مفقودی و یا آسیب دیدن کالا در انبار، جبران خسارت برعهده روناد خواهد‌بود.",
  },
  {
    id: 2,
    title: "آیا روناد سفارشات ارسال شده را بیمه می‌کند؟",
    content:
      "به ازای هر ۱ میلیون تومان ارزش مرسوله، مبلغ ۲۰۰۰ تومان بابت بیمه ارسال به مبلغ ارسال اضافه خواهد شد.",
  },
  {
    id: 3,
    title: "آیا امکان استفاده از کارتن شخصی وجود دارد؟",
    content:
      "شما می‌توانید کارتن شخصی خود را به روناد تحویل دهید. در این صورت سفارش‌های شما در کارتن‌های شخصی خودتان بسته بندی و ارسال خواهد شد.",
  },
];

const desktopData2 = [
  {
    id: 4,
    title: "حداکثر وزن و ابعاد مورد قبول برای ارسال سفارشات چقدر است؟",
    content: `حداکثر سایز کارتن موجود در روناد ۳۵×۴۵×۵۵ سانتی‌متر (سایز ۹ پستی) و حداکثر وزن کالا ۵۰ کیلوگرم می‌باشد. در صورت نیاز به بسته‌بندی با ابعاد بزرگ‌تر و وزن بیشتر، با واحد فروش تماس بگیرید!`,
  },
  {
    id: 5,
    title: "امکان ارسال سفارشات به صورت ویژه و فوری می‌باشد؟",
    content:
      "سرویس ویژه و فوری روناد برای همه مشتریان قابل استفاده می‌باشد. سفارشات ویژه طی ۲ ساعت از زمان ثبت سفارش ، آماده‌سازی و برای مشتری ارسال خواهد شد.",
  },
  {
    id: 6,
    title: "هزینه ارسال به شهرستان چقدر است؟",
    content:
      "هزینه ارسال به شهرستان به ازای هر سفارش بر اساس وزن، ابعاد و مقصد تعیین می‌شود و برخلاف هزینه پیک در تهران هزنیه ثابت از پیش تعیین شده ندارد.",
  },
];

const mobileData = [
  {
    id: 1,
    title: "هزینه بیمه نگهداری در روناد چقدر است؟",
    content:
      "بیمه نگهداری کالا در انبار روناد رایگان بوده و در صورت مفقودی و یا آسیب دیدن کالا در انبار، جبران خسارت برعهده روناد خواهد‌بود.",
  },
  {
    id: 2,
    title: "آیا روناد سفارشات ارسال شده را بیمه می‌کند؟",
    content:
      "به ازای هر ۱ میلیون تومان ارزش مرسوله، مبلغ ۲۰۰۰ تومان بابت بیمه ارسال به مبلغ ارسال اضافه خواهد شد.",
  },
  {
    id: 3,
    title: "آیا امکان استفاده از کارتن شخصی وجود دارد؟",
    content:
      "شما می‌توانید کارتن شخصی خود را به روناد تحویل دهید. در این صورت سفارش‌های شما در کارتن‌های شخصی خودتان بسته بندی و ارسال خواهد شد.",
  },
  {
    id: 4,
    title: "حداکثر وزن و ابعاد مورد قبول برای ارسال سفارشات چقدر است؟",
    content: `حداکثر سایز کارتن موجود در روناد ۳۵×۴۵×۵۵ سانتی‌متر (سایز ۹ پستی) و حداکثر وزن کالا ۵۰ کیلوگرم می‌باشد. در صورت نیاز به بسته‌بندی با ابعاد بزرگ‌تر و وزن بیشتر، با واحد فروش تماس بگیرید!`,
  },
  {
    id: 5,
    title: "امکان ارسال سفارشات به صورت ویژه و فوری می‌باشد؟",
    content:
      "سرویس ویژه و فوری روناد برای همه مشتریان قابل استفاده می‌باشد. سفارشات ویژه طی ۲ ساعت از زمان ثبت سفارش ، آماده‌سازی و برای مشتری ارسال خواهد شد.",
  },
  {
    id: 6,
    title: "هزینه ارسال به شهرستان چقدر است؟",
    content:
      "هزینه ارسال به شهرستان به ازای هر سفارش بر اساس وزن، ابعاد و مقصد تعیین می‌شود و برخلاف هزینه پیک در تهران هزنیه ثابت از پیش تعیین شده ندارد.",
  },
];
